var refreshicon = document.getElementById("refreshicon");
        var h3reference = document.getElementById("h3reference");
        var BanglaBornona = document.getElementById("BanglaBornona");
        var arabicreference = document.getElementById("arabicReferenceؕ");

h3reference.addEventListener("copy",function(){
alert("সম্মানিত হাজিরিন,আসসালামু আলাইকুম, ইতিমধ্যে আপনি হাদিসটির রেফারেন্স 'Copy' করতে সক্ষম হয়েছেন। আপনাকে অসংখ্য ধন্যবাদ। জাযাকাল্লাহু খাইরান। ❤️");
})

BanglaBornona.addEventListener("copy",function(){
alert("সম্মানিত হাজিরিন,আসসালামু আলাইকুম । আলহামদুলিল্লাহ্, ইতিমধ্যে আপনি হাদিস/লেখাটি 'Copy' করতে সক্ষম হয়েছেন। আপনাকে অসংখ্য ধন্যবাদ। জাযাকাল্লাহু খাইরান। ❤️");
})




var selectbox= document.getElementById("selectbox");
selectbox.addEventListener("change",function(event){
    if(event.target.value == "happy"){
        console.log("Happy Option");
        var refreshicon = document.getElementById("refreshicon");
        refreshicon.addEventListener("click",printQuote);


var happy = [
    {
      Description : "রাসুলুল্লাহ (সা.) সবসময় হাসিখুশি থাকতেন। মানুষের সঙ্গে ওঠবস, চলাফেরায় সর্বাবস্থায়ই তাঁর মুখে লেগে থাকত এক চিলতে হাসি। যেমনটি হাদিসে এসেছে, ‘আবদুল্লাহ ইবনে হারিস (রা.) থেকে বর্ণিত, তিনি বলেন, আমি রাসুলুল্লাহ (সা.)-এর চেয়ে অধিক মুচকি হাসে এমন কাউকে দেখিনি।’  আবদুল্লাহ ইবনে হারিস (রা.) থেকে বর্ণিত। তিনি বলেন, রাসুলুল্লাহ (সা.) সবসময় মুচকি হাসতেন।’ (শামায়েলে তিরমিজি)।",

reference : "(মুসনাদে আহমাদ, হা/১৭৭৫০; শারহুস সুন্নাহ, হা/৩৩৫০; শু’আবুল ঈমান, হা/৭৬৮৭ শামায়েলে তিরমিজি)।"
    },
    {
      Description: "যখন তুমি কোনো কারণ ছাড়াই আনন্দ অনুভব করো তখন এটা বিশ্বাস করবে যে, কেউ না কেউ কোথাও না কোথাও তোমার জন্য দোয়া করছে!",

reference : " হযরত আলী (রাঃ) থেকে বর্ণিত"
    }
  ]

function getRandomQuote () {
	var randomNumber = Math.floor(Math.random() * (happy.length));
	var randomQuote = happy[randomNumber];
	return randomQuote;
	console.log(randomNumber);
	console.log(randomQuote);
}	

function getRandomColor () {
	var red = Math.floor(Math.random() * 256 );
	var green = Math.floor(Math.random() * 256 );
	var blue = Math.floor(Math.random() * 256 );
	 var randomColor = 'rgb(' + red + ',' + green + ',' + blue + ')';
	return randomColor;
}


function printQuote () {
		var quotes = getRandomQuote ();
				if (quotes.reference){
				    h3reference.innerHTML= `${quotes.reference}`;
				}
	if (quotes.reference == null){
		h3reference.innerHTML= "";
				}
				
				if (quotes.Description) {
				    BanglaBornona.innerHTML=`${quotes.Description}`;
				}
				
	if(quotes.arabic){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML=`${quotes.arabic}`;
				}
	if(quotes.arabic == null){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML="";}
	
	
				else {
				    console.log("Nothing");
				}
				refreshicon.style.backgroundColor=getRandomColor ();
}
    }
    
    
    if(event.target.value == "sadness"){
        console.log("Sadness Option");
 var refreshicon = document.getElementById("refreshicon");
    refreshicon.addEventListener("click",printQuote);
        

var sadness = [
    {
      Description : " রাসুল (সা.) বলেন, আল্লাহ যে ব্যক্তির কল্যাণ কামনা করেন তাকে তিনি দুঃখকষ্টে পতিত করেন।",
reference : "(বুখারি, হাদিস : ৫৬৪৫)"
    },
    {
        Description : "হঠাৎ করেই একদিন দেখবেন আপনার অশ্রুসিক্ত দোয়া গুলো কবুল হয়ে গেছে, সেদিন ফিসফিস করে বলে উঠবেন। [হে আমার রব, আপনাকে ডেকে আমি কখনো নিরাশ হইনি। ]",
reference: "[সূরা মারইয়াম আয়াত ৪]"
    },
    {
        Description : "সমাজের সর্বস্তরের মানুষের প্রতি সদ্ধ্যব্যবহার করা উচিত। দূর্বোল মানুষের প্রতি কঠোরতা সম্পূর্ণরুপে পরিহার করা উচিত।যে অপরাধের স্বীকার ;-সে মজলুম। আর মজলুম ব্যক্তি যদিও কিছু সময়ের জন্য জালিমের দ্বারা আক্রান্ত হয়, তবু আল্লাহর কালাম এবং বিশ্বনবী (সা.)-এর বাণী অনুযায়ী আল্লাহ পাক স্বয়ং তাকে সাহায্য করেন। জালিমকে তার জুলুমের শেষ পর্যন্ত পৌঁছতে ব্যর্থ করে দেন। হাদিসের ভাষায়, রসুল (সা.) ইরশাদ করেন ‘নিশ্চয়ই আল্লাহতায়ালা জালিমকে অবকাশ দিয়ে থাকেন। অবশেষে তাকে এমনভাবে পাকড়াও করেন যে, সে আর ছুটে যেতে পারে না’- (সহিহ বোখারি, হাদিস নং-৪৬৮৬, সহিহ মুসলিম হাদিস নং-২৫৮৩)।",
        reference : "[ সহিহ বোখারি, হাদিস নং-৪৬৮৬, সহিহ মুসলিম হাদিস নং-২৫৮৩]"
    },
    {
        Description : "বাস্তবিকভাবে যদিও মজলুমের কিছু করার থাকে না, তবু আল্লাহর কাছে ফরিয়াদ করা উচিত। কেননা, মজলুমের দোয়া কবুলের ব্যাপারে কোনো সন্দেহ নেই। হাদিসে এসেছে ‘হজরত আবু হুরায়রা (রা.) বর্ণনা করেন, রসুলুল্লাহ (সা.) ইরশাদ করেন ‘তিন ব্যক্তির দোয়া অবশ্যই কবুল করা হয়, তাতে কোনো সন্দেহ নেই। আর তারা হলেন নির্যাতিত (মজলুম) ব্যক্তির দোয়া, মুসাফিরের দোয়া আর সন্তানের প্রতি পিতামাতার বদদোয়া’- (জামে তিরমিজি হাদিস নং-৩৫০৯)।",
        reference : "[জামে তিরমিজি হাদিস নং-৩৫০৯]"
    },
    {
Description: " কেউ যেন কারো উপহাস না করে। হতে পারে যাদেরকে উপহাস ও তাচ্ছিল্য করা হচ্ছে তারা (আল্লাহর নিকট) তোমাদের থেকে উত্তম।",
reference : "[হুজুরাতের আয়াত, যাতে আল্লাহ তাআলা মুআশারাতের দিকনির্দেশনামূলক বেশ কয়েকটি আয়াত অবতীর্ণ করেছেন। ইরশাদ করেন]"
        
    },
    {
        Description : "এই পার্থিব জীবনে,পৃথিবীর বুকে কে সন্মানিত হবে আর কে অসন্মানিত হবে সেটা আল্লাহ তায়ালা থেকে নির্ধারণ হয়। বল, ‘হে আল্লাহ, রাজত্বের মালিক, আপনি যাকে চান রাজত্ব দান করেন, আর যার থেকে চান রাজত্ব কেড়ে নেন এবং আপনি যাকে চান সম্মান দান করেন। আর যাকে চান অপমানিত করেন, আপনার হাতেই কল্যাণ। নিশ্চয় আপনি সব কিছুর উপর ক্ষমতাবান’। আল-বায়ান",
        reference : "[আল-বায়ান]"
    },
    {
        Description : "মজলুমের পক্ষে কেউ না থাকলেও আল্লাহ তার এমন সহায় হোন যে, তার দোয়া কবুলের মাঝে কোনো প্রতিবন্ধকতা বা পর্দা থাকে না। হাদিসের ভাষায়, ‘মজলুমের বদদোয়াকে ভয় করো। তার মাঝে (বদদোয়া) আল্লাহর মাঝে (কবুলের) কোনো পর্দা থাকে না।’ (সহিহ বোখারি, হাদিস নং-১৪৯৬)। ",
        reference : "[সহিহ বোখারি,হাদিস নং- ১৪৯৬]"
    },
    {
   Description : "তোমরা আমার কাছে চাও, আমি তোমাদের ডাকে সাড়া দিবো। তোমাদের চাওয়াকে পাওয়াতে রূপ দিবো।",
reference : "[সূরা মুমিন-৬০]"
},
    {
      Description : "ঘোর বিপদে চারদিকে অন্ধকার দেখলেও হতাশ হবেন না। ইউনুস (আ.) সাগরে মাছের পেটের অন্ধকার প্রকোষ্ট থেকেও উদ্ধার হয়েছিলেন। ",
    },
    {
        Description: "জীবন নিয়ে হতাশ হয়ো না,জীবনের সর্বত্রে সবর করো। আল্লাহর কাছে চাও। [নিশ্চয়ই আল্লাহ সবচেয়ে উত্তম পরিকল্পনাকারী। (সূরা আনফাল:৩০)]তোমার চিন্তা-ভাবনা/পরিকল্পনা যদি হয় কেবল একটি ফুল। মহান আল্লাহর পরিকল্পনা একটু ফুলের বাগান। আর এটাই সেই তোমার রব,যে তোমাকে ভালোবাসে,[আর শীঘ্রই তোমার রব তোমাকে এত দিবেন, যে তুমি খুশি হয়ে যাবে। (সূরা আদ দূহা:৫)] ❤️"
    },
    {
      Description : "আপনার বিরুদ্ধে অপবাদ ও গুজব রটলে ভেঙে পড়বেন না। আয়েশা (রা.)-এর বিরুদ্ধেও অপবাদ আরোপ করা হয়েছিল। আল্লাহ তাঁকে হেফাজত করেছেন। ",
    },
{
      Description : "মানুষ আপনাকে নিয়ে বিদ্রুপ করলে ভেঙে পড়বেন না। আমাদের নবীসহ যুগে যুগে সব নবীকে নিয়ে অজ্ঞ ও অবিশ্বাসীরা ব্যঙ্গ-বিদ্রুপ করেছিল, কিন্তু পরিশেষে নবীরাই সফল হয়েছেন।",
    },

{
      Description : "একের পর এক বিপদে হতাশ হবেন না। আল্লাহ তাঁর প্রিয় বান্দাদের বেশি বেশি পরীক্ষায় ফেলেন। নবী-রাসুলদের তিনি সর্বাধিক পরীক্ষা করেছেন। পরিশেষে তাঁদের উদ্ধার করেছিলেন।",
    },
{
Description :"শুধু রোগ-ব্যাধি কেন মুমিনের যেকোনো দুঃখ-কষ্টের বিনিময়ে মহান আল্লাহ তাকে পাপমুক্ত করেন। আবু হুরায়রা (রা.) থেকে বর্ণিত, নবী (সা.) বলেছেন, মুসলিম ব্যক্তির ওপর যে কষ্ট ক্লেশ, রোগ-ব্যাধি, উদ্বেগ-উত্কণ্ঠা, দুশ্চিন্তা, কষ্ট ও পেরেশানি আসে, এমনকি যে কাঁটা তার দেহে ফোটে, এসবের মাধ্যমে আল্লাহ তার গুনাহসমূহ ক্ষমা করে দেন।",
reference :"(বুখারি, হাদিস : ৫৬৪১)"
},
{  
      Description : " আল্লাহ কষ্টের পর সুখ দিবেন। ",
      reference: " [সুরা তালাক : ৭] "
},
{
    arabic:" إِنَّ مَعَ الْعُسْرِ يُسْرًا ",
      Description : "নিশ্চয়ই কষ্টের সাথে রয়েছে স্বস্তি।  ",
      reference: "[সুরা ইনশিরাহ : ৬] "
},
{
arabic:" أَلَا إِنَّ نَصْرَ اللَّهِ قَرِيبٌ اللَّهِ ",
      Description : "জেনে রেখো, আল্লাহর সাহায্য নিকটে।",
      reference: "[সুরা বাকারা : ২১৪]"
},
{
arabic:" وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ",
      Description : "আল্লাহর রহমত থেকে নিরাশ হয়ো না। নিশ্চয় আল্লাহর রহমত থেকে কাফের সম্প্রদায় ব্যতীত অন্য কেউ নিরাশ হয় না।",
      reference: "[সুরা ইউসুফ : ৮৭]।"
},
{
    arabic:"  لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ",
      Description : "আল্লাহ কোনো ব্যক্তির উপর তার সাধ্যের চাইতে বেশি বোঝা চাপিয়ে দেন না।",
      reference: " [সুরা বাকারা : ২৮৬]"
},
{
    Description : "অভিভাবক হিসাবে ও সাহায্যকারী হিসাবে আল্লাহই যথেষ্ট ।",
      reference: "[সূরা আন-নিসা,আয়াত:৪৫] "
},
{
    Description : "প্রিয়নবী (সা.) হাদিসে বলেন,আল্লাহ যার ভালো চান তাকে দুঃখ কষ্টে ফেলেন।",
      reference: "[ বুখারি, হাদিস নং: ৫৬৪৫] "
},
{
    Description : " যদি তোমরা শুকরিয়া আদায় করো,তবে আমি অব্শ্যই তোমাদের নেয়ামত বাড়িয়ে দেবো",
      reference: "[সূরা ইবরাহিম : ০৭] "
},
{
    Description : "হাদিসে রাসুল (সা.) আরো বলেন, যদি কারো উপর কোনো কষ্ট আসে, আল্লাহ তাআলা এর কারণে তার গুনাহসমূহ ঝরিয়ে দেন; যেমনভাবে গাছ থেকে পাতা ঝরে পড়ে। ",
      reference: "[বুখারি, হাদিস নং: ৫৬৮৪]"
},
{
    Description :"সবর কর,যতক্ষণ না আল্লাহ ফয়সালা করেন!আর তিনিই উওম ফয়সালাকারী আলহামদুলিল্লাহ্।",
    reference: "[সূরা ইউনুস:১০৯]"
},
{
    Description :"অবশ্যই তুমি পাবে,যা তোমার থেকে চলে গেছে তার চেয়েও উত্তম।",
    reference : "[সুরা আনফালঃ ৭০]"
},
{
    Description : "নিশ্চয় আল্লাহ সকল ব্যথিত ও চিন্তিত অন্তরকে ভালোবাসেন।",
   reference :" [শুআবুল ইমান,৮৬৬]"
},
{
    Description : "রাসূল (সা.) বলেছেন, ‘তোমাদের প্রভু খুবই লজ্জাশীল। বান্দা যখন দোয়ার জন্য হাত উঠায়, সে হাত খালি ফিরিয়ে দিতে আল্লাহ লজ্জা পান।’ ",
   reference :"(আবু দাউদ, হাদিস নম্বর ৩৩৭০।)"
},
{
    Description :"আল্লাহ বলেন, ‘হে রাসূল! যখন আমার বান্দা আমার সম্পর্কে আপনাকে জিজ্ঞেস করে, তখন বলে দিন- আমি বান্দার খুব কাছেই আছি। সে যখনই আমার কাছে দোয়া করে, আমি তার দোয়া কবুল করি’ ",
reference :"(সূরা বাকারা, আয়াত ১৮৬।)"
},
{
    Description : "মহান আল্লাহ তায়ালা বলেন ;- আকাশের দিকে বারবার তোমার তাকানোকে আমি অবশ্যই লক্ষ করি।",
     reference : "[সূরা বাকারা, আয়াত ১৪৪]"
},
{
    Description :" কিন্তু তোমরা যা অপছন্দ কর হতে পারে তা তোমাদের জন্য কল্যাণকর এবং যা ভালবাসো, হতে পারে তা তোমাদের জন্য অকল্যাণকর। আর আল্লাহ্‌ জানেন তোমরা জান না।",
reference : "[সূরা বাকারা, আয়াত ২১৬।]"
},
{
Description : "[আবূ হুরায়রাহ্ (রাঃ)] হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সা.) বলেছেন: যখন তোমাদের কেউ এমন ব্যক্তিকে দেখে যাকে মাল-সম্পদে, স্বাস্থ্য-সামর্থ্যে অধিক দেয়া হয়েছে, তখন সে যেন নিজের চাইতে নিম্নমানের ব্যক্তির দিকে তাকায়। (বুখারী ও মুসলিম), সহীহ মুসলিম-এর এক বর্ণনায় আছে, তিনি (সা.) বলেছেন: তোমরা নিজেদের অপেক্ষা নিম্ন অবস্থার লোকের প্রতি তাকাও। এমন ব্যক্তির দিকে তাকিয়ো না যে তোমাদের চাইতে উচ্চ পর্যায়ের। তাহলে এ পন্থা অবলম্বনই হবে আল্লাহর নি’আমাতকে অবজ্ঞা না করার এক উপযোগী মাধ্যম।",

reference : "সহীহ বুখারী ৬৪৯০, মুসলিম ৮-(২৯৬৩), সহীহুল জামি ৮০৮, সহীহ ইবনু হিব্বান ৭১১, শুআবুল ঈমান ১০২৮৪, আল মু'জামুল কাবীর লিত্ব ত্ববারানী ২৯৪, আল মু'জামুল আওসাত্ব ৫৭৮।"
},
{
Description : "আবূ আব্বাস আব্দুল্লাহ্ ইবনু আব্বাস রাদিয়াল্লাহু ’আনহু বর্ণনা করেছেন- একদিন আমি রাসূলুল্লাহ্ (সাল্লাল্লাহু ’আলাইহি ওয়াসাল্লাম)-এর পিছনে ছিলাম, তিনি আমাকে বললেন: হে যুবক! আমি তোমাকে কয়েকটি কথা শেখাবো- আল্লাহকে সংরক্ষণ করবে[1] তো তিনি তোমাকে সংরক্ষণ করবেন, আল্লাহকে স্মরণ করলে তাঁকে তোমার সামনেই পাবে। যখন কিছু চাইবে তো আল্লাহর কাছেই চাইবে; যখন সাহায্য চাইবে তো আল্লাহর কাছেই সাহায্য চাইবে। জেনে রাখ, সমস্ত মানুষ যদি তোমার কোন উপকার করতে চায় তবে আল্লাহ্ তোমার জন্য যা নির্দিষ্ট করে দিয়েছেন, তা ব্যতীত আর কোন উপকার করতে পারবে না। আর যদি সমস্ত মানুষ তোমার কোন অনিষ্ট করতে চায় তবে আল্লাহ্ তোমার জন্য যা নির্দিষ্ট করে দিয়েছেন তা ব্যতীত আর কোন অনিষ্ট করতে পারবে না। কলম তুলে নেয়া হয়েছে এবং পৃষ্ঠা শুকিয়ে গেছে। ",

reference :"[তিরমিযী: ২৫১৬, হাদীসটি সহীহ্ (হাসান) বলেছেন।]"
},
{
Description : "আল্লাহকে স্মরণ করবে তো তাঁকে তোমার সম্মুখে পাবে, তুমি স্বচ্ছল অবস্থায় আল্লাহকে স্মরণ করবে তো তিনি তোমাকে কঠিন অবস্থায় স্মরণ করবেন। মনে রেখো- যা তুমি পেলে না, তা তোমার পাবার ছিল না, আর যা তুমি পেলে তা তুমি না পেয়ে থাকতে না। আরো জেনে রাখো- ধৈর্য্য ধারণের ফলে (আল্লাহর) সাহায্য লাভ করা যায়। কষ্টের পর স্বাচ্ছন্দ আসে। কঠিন অবস্থার পর স্বচ্ছলতা আসে। "
},
{
  Description: "আল্লাহ বলেন, আমি তো কাছেই আছি,যখন কেউ আমাকে ডাকে,আমি তার ডাকে সাড়া দেই।", 
reference : "[আল-বাকারাঃ ১৮৬]"
},
{
Description : " তোমার রব তোমাকে পরিত্যাগ করেন'নি এবং অসন্তুষ্ট'ও হননি।",
reference :"[সূরা  আদ দুহাঃ৩]"
},
{
Description : "রাসুল (সাঃ) বলেন, তোমাদের কোনো লোক হারানো প্রাণী পাওয়ার পর যে সমান আনন্দিত হয়। তোমাদের তওবা’র কারণে আল্লাহ তায়ালা এর চেয়ে বেশি খুশি হন।",
 reference :"[সহিহ মুসলিম ৬৮৪৬]"
},
{
Description : "যে ব্যাক্তি চিন্তা-পেরেশানীর সময় অধিক পরিমাণে দরুদ শরীফ পড়বে,এর বরকতে আল্লাহ তায়ালা সকল পেরেশানী দূর করে দেবেন।",
reference :" [জামে তিরমিযী,হাদিস ২৪৫৭;মুসতাদরাকে হাকেম,হাদিস ৩৬২০]"
},
{
Description : "সূরা ইউসূফ কতো সুন্দর!এটা আমাদের শেখায়,কাছের মানুষগুলো বিশ্বাসঘাতকতা করতে পারে,ভাঙা হৃদয় ভালোবাসা দিয়ে সারিয়ে তুলতে পারে, কষ্টের পর সচ্ছলতা আসে,দুঃখী হওয়া আর অকৃতজ্ঞ হওয়া সমান নয়,এবং ধৈর্যশীল মানুষদের শেষ পরিনতি সুন্দর হয়।",
},
{
Description : "আর রাতের কিছু অংশে তাহাজ্জুদ আদায় করো। তোমার অতিরিক্ত দায়িত্ব হিসেবে। আশা করা যায়,তোমার রব তোমাকে প্রসংশিত অবস্থানে প্রতিষ্ঠিত করবেন।",
reference :" [সূরা বনী-ইসরাইলঃ৭৯]"
},
{
Description :"মুমিন নারী-পুরুষের উপর,তার সন্তানের উপর ও তার ধন-সম্পদের উপর অনবরত বিপদাপদ লেগেই থেকে।সবশেষে আল্লাহ তায়ালার সাথে সে গুনাহমুক্ত অবস্থায় মিলিত হয়।",
reference :  " [তিরমিজী ২৩৯৯]"
},
{
  Description :" রাসুল (সাঃ) বলেন;- একজন মা তার সন্তানের উপর যতটা দয়ালু,আল্লাহ তার বান্দার উপর তার চেয়েও বেশি দয়ালু।",
reference :"[সহিহ বুখারী ৫৯৯৯]"
},
{
Description : "নিশ্বাস'টা ভারী হয়ে গেলে, সিজদায়ে লুটিয়ে পড়ে হালকা করে নাও। জেনে রাখো,আল্লাহর স্মরণেই হৃদয় প্রশান্ত হয়।",
reference :"[সূরা রাদঃ ২৮]"
},
{
Description : "মহান আল্লাহ তায়ালা বলেন - বান্দা যখন আমার দিকে এক হাত অগ্রসর হয়,আমি তার দিকে দু'হাত এগিয়ে যায়। আর সে যদি আমার দিকে হেঁটে আসে,আমি তার দিকে দৌড়ে যায়।",
reference : "[সহীহ বুখারী ৭৪০৫]"
},
{
Description :"সফলতা পাওয়ার জন্য আল্লাহ তায়ালার উপর ভরসা করাটা খুব'ই জরুরী।  আল্লাহ বলেন -  যদি আল্লাহ চান, কেউ তাকে পেছনে ফেলতে পারবে না। আর তিনি সাহায্য না করলে, কে আছে  এমন যে সাহায্য করবে। আর মুমিন যেন কেবল আল্লাহ তায়ালার উপর'ই ভরসা করে।",
reference : "[সূরা আল-ইমরানঃ১৬০]"
},
{
Description : " বান্দা যখন সালাতে দাঁড়ায় তার সমস্ত গুনাহ তার দুই কাধে রেখে দেওয়া হয়। যতবার সে রুকু, সিজদাহ করে ততবার গুনাহ সমূহ ঝড়ে পড়ে।",
reference : "[সিলসিলা সহিহা হা/৫৭৫]"
},
{ 
 Description : "রাসুল (সাঃ) বলেছেন;- যখন কোনো ব্যক্তি তার ঘর থেকে মসজিদের দিকে বের হয়,তখন তার এক পদক্ষেপে একটি নেকি লেখা হয়। আর এক পদক্ষেপে একটি গুনাহ মুছে ফেলা হয়।",
reference : "[সুনানে আন নাসায়ীঃ৭০৫]"
},
{
Description : "আযান ও ইকামাতের মধ্যবর্তী সময়ের দু'য়া কখনো প্রত্যাখ্যাত হয়’না।",
reference : " [তিরমিযী ২১২]"
},
{
Description : "রাসুল (সাঃ) বলেছেন;- নিশ্চয় আল্লাহ তোমাদের সৌন্দর্য্য ও সম্পদের দিকে তাকাবেন না। বরং তিনি দেখবেন তোমার আমল ও অন্তর।",
reference : "[সহিহ মুসলিম হাদিস ২৫৬৪]"
},
{
Description : "বান্দা যখন সিজদায় থাকে তখন তার রবের সবচাইতে নিকটবর্তী হয়। কাজেই তোমরা (সিজদায় গিয়ে) বেশি করে দু'আ কর।",
reference : "[মুসলিম, রিয়াদুস সালেহীন- ১৪৯৮]"
},
{
Description : "মানসিক অশান্তি থেকে মুক্ত থাকতে মহান আল্লাহর প্রতি তাওয়াক্কুলের বিকল্প নেই। কেননা তিনিই বলেছেন মহান আল্লাহর প্রতি তাওয়াক্কুল বা ভরসা করে তার জন্য আল্লাহই যথেষ্ট।",
reference :  "[সূরা তালাক -আয়াত ৩]"
},
{
   Description : " মানুষ যখন বলে;- আমার জীবনে অনেক কষ্ট। আল্লাহ বলেন, নিশ্চয়ই কষ্টের সাথে আছে স্বস্তি।",
reference :"[সুরা আলাম নাশরাহ ৯৪ঃ৬]"
},
{
Description : " মানুষ যখন বলে;- আমার কেউ নেই। আল্লাহ বলেন, যে ব্যক্তি আল্লাহর উপর ভরসা করে, তার জন্য আল্লাহই যথেষ্ট।",
reference : "[সুরা তালাক ৬৫ঃ৩]"
},
{
    Description : "যখন মানুষ বলে;- আমি ব্যর্থ,আল্লাহ বলেন; বিশ্বাসীরা সফল হয়।",
    reference: "(সুরা মু'মিনুন ২৩ঃ১)"
},
{
    Description : "যখন মানুষ বলে;- আমাকে একা করে দিও না, আল্লাহ বললেন আমাকে স্মরণ করো আমি তোমাকে স্বরণ করবো।",
    reference: "সূরা বাকারা আয়াত ১৫২"
},
{
    Description : "জীবনে হোচট খান,দুঃখ পান,কিংবা একাকিত্ব অনূভব করেন,যেটাই হোক'না কেন,কিন্তু হতাশ হয়েন না। নামায পড়েন,দোয়া করেন,আল্লাহর কাছে চান,মহান আল্লাহ তায়ালা'র নিকট তায়াক্কুল করেন,সবর করেন,ইনশাআল্লাহ শেষটা ভালো হবে। কেনন,নিশ্চয় আল্লাহ ভালোবাসেন তার উপর ভরসাকারীদের,(আল ইমরান, ১৫৯),আল্লাহ ধৈর্যশীলদের ভালোবাসেন, (আল ইমরান, ১৪৬ )",
    reference : "[আল আল-ইমরানঃ১৫৯,আল-ইমরানঃ১৫৬]"
},
{
    Description : "একবার এক,ইরানের বিখ্যাত কবি শেখ সাদি রাহমাতু্ল্লাহ, শেখ সাদি নামে পরিচিত। তো উনি একবার আর্থিক সমস্যার মধ্য দিয়ে সময় কাটাচ্ছিলেন। টাকা নাই,পয়সা নাই। পায়ে দেওয়া মতো জুতো'ও নাই। উনি মনে মনে খুব দুঃখ পেলেন,হায়রে আমি ইরানের একজন বিখ্যাত কবি,আর আমার পায়ে'ই জুতো নাই। মন'টা খুব খারাপ হয়ে গেল তার, তার সেই দুঃখ  ভরা মন নিয়ে হাঁটতেছে,হাঁটতে হাঁটতে অনেক দূরে চলে গেছে,হঠাৎ যেয়ে দেখে এক লোক বসে বসে কাঁদতেছে তার দুটো পা ই নেই। শেখ সাদি রাহমাতু্ল্লাহ সাথে সাথে সেজদায় পড়ে গেলেন, বললেন আল্লাহ তুমি অনেক কিছু দিয়েছো, আমার আর কিচ্ছু চাইনা, আল্লাহ তুমি আমাকে ক্ষমা করে দাও। এবং আল্লাহর কাছে ক্ষমা চাইলেন। সুতরাং অল্পতে সন্তুষ্ট থাকাটাই শান্তি।আমরা যে যেই অবস্থায় থাকি না কেন,সর্বদা আমরা শুকরিয়া আদায় করবো। "
},
{
Description : "আল্লাহ'কে পাওয়ার জন্য যারা আল্লাহর রাস্তা তালাশ করে,তারা যদি আল্লাহর রাস্তা খুঁজে নাও পায়,মহান আল্লাহ তায়ালা স্বয়ং তাদের রাস্তা দেখিয়ে দেন।",
reference : "[সূরা আনকাবুত,আয়াত ৬৯]"
},
{
Description : "যখন মানুষ বলে,আমার কেউ নেই। মহান আল্লাহ তায়ালা বলেন, তোমরা ভয় করো না,আমি তোমাদের সাথেই আছি। আমি সব কিছু শুনি আর দেখি।",
reference : "[সূরা ত্বহা,আয়াত ৪৬]"
},

{
Description : "আর অবশ্যই তোমার ভবিষ্যৎ,তোমার অতীতের চেয়ে উত্তম। অচিরেই তোমার রব তোমাকে এমন কিছু দান করবেন। যাতে তুমি সন্তুষ্ট হয়ে যাবে।",
reference : "[সূরা আদ-দুহা, আয়াত ৪-৫]"
},
{
Description : "কোরআন শরীফে ৩০ আয়াত বিশিষ্ট একটি সূরা আছে। যা তার তেলাওয়াতকারীকে ক্ষমা করে না দেওয়া পর্যন্ত তার জন্য সুপারিশ করতেই থাকবে। সূরাটি হলো,সূরা মূলক।",
reference : "[আবু দাউদ ১৪০২,তিরমিযী ২৮৯১,ইবনে মাজাহ ৩৭৮৬]"
},

{
Description : "মহান আল্লাহ তায়ালা বলেন,বান্দা যখন আমার দিকে এক হাত অগ্রসর হন। আমি তার দিকে দুই হাত এগিয়ে যাই। আর সে যদি সে যদি আমার দিকে হেঁটে আসে,আমি তার দিকে দৌঁড়ে যাই।",
reference : "[সহিহ বুখারীঃ ৭৪০৫]"
},

{
Description : "জুম্মার দিনে এমন একটা সময় আছে, যখন কোনো মুসলিম বান্দা নামায আদায় করে আল্লাহ তায়ালার কাছে কিছু চাইলে। তিনি অবশ্যই তাকে তা দান করেন। (ঐ সময়টি আসরের পর থেকে সূর্য আস্ত যাওয়া পর্যন্ত)",
reference : "[তিরমিজি ৪৯১]"
},

{
Description : "রাসুল সাঃ বলেছেন ;- আল্লাহ তায়ালা'র (একশত ভাগ) রহমত আছে। তার মধ্যে এক ভাগ রহমতের দ্বারাই সৃষ্ট জীব পরস্পর একে অন্যের প্রতি দয়া প্রদর্শন করেন। বাকি নিরানব্বই ভাগ রহমত রাখা হয়েছে কিয়ামত দিনের জন্য।",
reference : "[সহিহ মুসলিম ৬৮৬৮]"
},

{
Description : "আল্লাহ ব্যতিত তোমাদের কোনো বন্ধু ও সাহায্যকারী নেই।",
reference : "[সূরা বাকারা, আয়াত ১০৭]"
},
{
Description : "পরিপূর্ণ মানসিক শান্তি একমাত্র আল্লাহ’র দিকেই রয়েছে।",
reference : "[সূরা আর-রাদ, আয়াত ২৮]"
},

{
Description : "ইবলিশ তার রবকে বলেছে;- আপনার ইজ্জত ও বড়ত্বের কসম, আমি বনী আদমকে পথ ভ্রষ্ট করতেই থাকবো, যতক্ষণ তাদের মধ্যে রুহ থাকে। মহান আল্লাহ তায়ালা বলেনঃ আমার ইজ্জত ও বড়ত্বের কসম, আমি তাদের ক্ষমা করতে থাকবো, যতক্ষণ তারা আমার নিকট ইস্তেগফার করে।",
reference : "[সহিহ হাদিসে কুদসি ৩২]"
},

{
Description : "তোমরা সিজদায় বেশি বেশি দোয়া করো। কেননা সিজদা হচ্ছে দোয়া কবুলের উপযুক্ত সময়।",
reference : "[মুসলিম হাদিস ৮৭০]"
},
{
Description : "আর যে ব্যক্তি আল্লাহর উপর ভরসা করবেন। তার জন্য তিনিই যথেষ্ট হবেন। মহান আল্লাহ তায়ালা তার ইচ্ছে পূরণ করবেন'ই। 'নিশ্চয় আল্লাহ তায়ালা প্রত্যেক জিনিসের জন্য একটি সময়-সীমা নির্ধারণ করে দিয়েছেন।' ",
reference :"[সূরা আত-ত্বলাক, আয়াত ৩]"
},

{
Description : "কাউকে অভিশাপ দেওয়ার আগে হাদিস'টি একটু পড়ুনঃ-যখন কেউ কাউকে অভিশাপ দেয়, তখন তা আকাশে চলে যায়। আকাশের দরজাগুলো তখন বন্ধ হয়ে যায়। এবং অভিশাপ জমিনে নেমে এসে ডানে বাঁয়ে ঘুরতে থাকে,এক সময় যাকে অভিসম্পাত করা হয়েছে। সে যদি সেই অভিশাপের যোগ্য হয় তাহলে তার প্রতি পতিত হয় অন্যথায় সেই অভিশাপ অভিশাপকারীর দিকেই ধাপিত হয়।",
reference : "[আবু দাউদ ৪৯০৫]"
},

{
Description : "পৃথিবীর জীবন ছলনাময় ভোগ ব্যতিত আর কিছুই নয়।",
reference : "[সূরা আল ইমরান, আয়াত ১৮৫]"
}

]
function getRandomQuote () {
	var randomNumber = Math.floor(Math.random() * (sadness.length));
	var randomQuote = sadness[randomNumber];
	return randomQuote;
	console.log(randomNumber);
	console.log(randomQuote);
}	

function getRandomColor () {
	var red = Math.floor(Math.random() * 256 );
	var green = Math.floor(Math.random() * 256 );
	var blue = Math.floor(Math.random() * 256 );
	 var randomColor = 'rgb(' + red + ',' + green + ',' + blue + ')';
	return randomColor;
}


function printQuote () {
		var quotes = getRandomQuote ();
				if (quotes.reference){
				    h3reference.innerHTML= `${quotes.reference}`;
				}
		if (quotes.reference == null){
				    h3reference.innerHTML= "";
				}
				
				if (quotes.Description) {
				    BanglaBornona.innerHTML=`${quotes.Description}`;
				}
				if(quotes.arabic){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML=`${quotes.arabic}`;
				}
				if(quotes.arabic == null){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML="";}
				else {
				    console.log("Nothing");
				}
				refreshicon.style.backgroundColor=getRandomColor ();
}



    }
    if(event.target.value == "lonely"){
        console.log("Lonely Option");
        var refreshicon = document.getElementById("refreshicon");
refreshicon.addEventListener("click",printQuote);
        
  var hadiths = [
    {
      Description : " রাসুল (সা.) বলেন, আল্লাহ যে ব্যক্তির কল্যাণ কামনা করেন তাকে তিনি দুঃখকষ্টে পতিত করেন।",
reference : "(বুখারি, হাদিস : ৫৬৪৫)"
    },
    {
      Description : "ঘোর বিপদে চারদিকে অন্ধকার দেখলেও হতাশ হবেন না। ইউনুস (আ.) সাগরে মাছের পেটের অন্ধকার প্রকোষ্ট থেকেও উদ্ধার হয়েছিলেন। ",
    },
    
    {
      Description : "আপনার বিরুদ্ধে অপবাদ ও গুজব রটলে ভেঙে পড়বেন না। আয়েশা (রা.)-এর বিরুদ্ধেও অপবাদ আরোপ করা হয়েছিল। আল্লাহ তাঁকে হেফাজত করেছেন। ",
    },
{
      Description : "মানুষ আপনাকে নিয়ে বিদ্রুপ করলে ভেঙে পড়বেন না। আমাদের নবীসহ যুগে যুগে সব নবীকে নিয়ে অজ্ঞ ও অবিশ্বাসীরা ব্যঙ্গ-বিদ্রুপ করেছিল, কিন্তু পরিশেষে নবীরাই সফল হয়েছেন।",
    },

{
      Description : "একের পর এক বিপদে হতাশ হবেন না। আল্লাহ তাঁর প্রিয় বান্দাদের বেশি বেশি পরীক্ষায় ফেলেন। নবী-রাসুলদের তিনি সর্বাধিক পরীক্ষা করেছেন। পরিশেষে তাঁদের উদ্ধার করেছিলেন।",
    },
{
Description :"শুধু রোগ-ব্যাধি কেন মুমিনের যেকোনো দুঃখ-কষ্টের বিনিময়ে মহান আল্লাহ তাকে পাপমুক্ত করেন। আবু হুরায়রা (রা.) থেকে বর্ণিত, নবী (সা.) বলেছেন, মুসলিম ব্যক্তির ওপর যে কষ্ট ক্লেশ, রোগ-ব্যাধি, উদ্বেগ-উত্কণ্ঠা, দুশ্চিন্তা, কষ্ট ও পেরেশানি আসে, এমনকি যে কাঁটা তার দেহে ফোটে, এসবের মাধ্যমে আল্লাহ তার গুনাহসমূহ ক্ষমা করে দেন।",
reference :"(বুখারি, হাদিস : ৫৬৪১)"
},
{ 
    Description : " আল্লাহ কষ্টের পর সুখ দিবেন। ",
      reference: " [সুরা তালাক : ৭] "
},
{
    arabic:" إِنَّ مَعَ الْعُسْرِ يُسْرًا ",
      Description : "নিশ্চয়ই কষ্টের সাথে রয়েছে স্বস্তি।  ",
      reference: "[সুরা ইনশিরাহ : ৬] "
},
{
arabic:" أَلَا إِنَّ نَصْرَ اللَّهِ قَرِيبٌ اللَّهِ ",
      Description : "জেনে রেখো, আল্লাহর সাহায্য নিকটে।",
      reference: "[সুরা বাকারা : ২১৪]"
},
{
arabic:" وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ",
      Description : "আল্লাহর রহমত থেকে নিরাশ হয়ো না। নিশ্চয় আল্লাহর রহমত থেকে কাফের সম্প্রদায় ব্যতীত অন্য কেউ নিরাশ হয় না।",
      reference: "[সুরা ইউসুফ : ৮৭]।"
},
{
    arabic:"  لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ",
      Description : "আল্লাহ কোনো ব্যক্তির উপর তার সাধ্যের চাইতে বেশি বোঝা চাপিয়ে দেন না।",
      reference: " [সুরা বাকারা : ২৮৬]"
},
{
    Description : "অভিভাবক হিসাবে ও সাহায্যকারী হিসাবে আল্লাহই যথেষ্ট ।",
      reference: "[সূরা আন-নিসা,আয়াত:৪৫] "
},
{
    Description : "প্রিয়নবী (সা.) হাদিসে বলেন,আল্লাহ যার ভালো চান তাকে দুঃখ কষ্টে ফেলেন।",
      reference: "[ বুখারি, হাদিস নং: ৫৬৪৫] "
},
{
    Description : " যদি তোমরা শুকরিয়া আদায় করো,তবে আমি অব্শ্যই তোমাদের নেয়ামত বাড়িয়ে দেবো",
      reference: "[সূরা ইবরাহিম : ০৭] "
},
{
    Description : "হাদিসে রাসুল (সা.) আরো বলেন, যদি কারো উপর কোনো কষ্ট আসে, আল্লাহ তাআলা এর কারণে তার গুনাহসমূহ ঝরিয়ে দেন; যেমনভাবে গাছ থেকে পাতা ঝরে পড়ে। ",
      reference: "[বুখারি, হাদিস নং: ৫৬৮৪]"
},
{
    Description :"সবর কর,যতক্ষণ না আল্লাহ ফয়সালা করেন!আর তিনিই উওম ফয়সালাকারী আলহামদুলিল্লাহ্।",
    reference: "[সূরা ইউনুস:১০৯]"
},
{
    Description :"অবশ্যই তুমি পাবে,যা তোমার থেকে চলে গেছে তার চেয়েও উত্তম।",
    reference : "[সুরা আনফালঃ ৭০]"
},
{
    Description : "নিশ্চয় আল্লাহ সকল ব্যথিত ও চিন্তিত অন্তরকে ভালোবাসেন।",
   reference :" [শুআবুল ইমান,৮৬৬]"
},
{
    Description : "রাসূল (সা.) বলেছেন, ‘তোমাদের প্রভু খুবই লজ্জাশীল। বান্দা যখন দোয়ার জন্য হাত উঠায়, সে হাত খালি ফিরিয়ে দিতে আল্লাহ লজ্জা পান।’ ",
   reference :"(আবু দাউদ, হাদিস নম্বর ৩৩৭০।)"
},
{
    Description :"আল্লাহ বলেন, ‘হে রাসূল! যখন আমার বান্দা আমার সম্পর্কে আপনাকে জিজ্ঞেস করে, তখন বলে দিন- আমি বান্দার খুব কাছেই আছি। সে যখনই আমার কাছে দোয়া করে, আমি তার দোয়া কবুল করি’ ",
reference :"(সূরা বাকারা, আয়াত ১৮৬।)"
},
{
    Description : "মহান আল্লাহ তায়ালা বলেন ;- আকাশের দিকে বারবার তোমার তাকানোকে আমি অবশ্যই লক্ষ করি।",
     reference : "[সূরা বাকারা, আয়াত ১৪৪]"
},
{
    Description :" কিন্তু তোমরা যা অপছন্দ কর হতে পারে তা তোমাদের জন্য কল্যাণকর এবং যা ভালবাস হতে পারে তা তোমাদের জন্য অকল্যাণকর। আর আল্লাহ্‌ জানেন তোমরা জান না।",
reference : "[সূরা বাকারা, আয়াত ২১৬।]"
},
{
Description : "[আবূ হুরায়রাহ্ (রাঃ)] হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সা.) বলেছেন: যখন তোমাদের কেউ এমন ব্যক্তিকে দেখে যাকে মাল-সম্পদে, স্বাস্থ্য-সামর্থ্যে অধিক দেয়া হয়েছে, তখন সে যেন নিজের চাইতে নিম্নমানের ব্যক্তির দিকে তাকায়। (বুখারী ও মুসলিম),সহীহ মুসলিম-এর এক বর্ণনায় আছে, তিনি (সা.) বলেছেন: তোমরা নিজেদের অপেক্ষা নিম্ন অবস্থার লোকের প্রতি তাকাও। এমন ব্যক্তির দিকে তাকিয়ো না যে তোমাদের চাইতে উচ্চ পর্যায়ের। তাহলে এ পন্থা অবলম্বনই হবে আল্লাহর নি’আমাতকে অবজ্ঞা না করার এক উপযোগী মাধ্যম।",

reference : "সহীহ বুখারী ৬৪৯০, মুসলিম ৮-(২৯৬৩), সহীহুল জামি ৮০৮, সহীহ ইবনু হিব্বান ৭১১, শুআবুল ঈমান ১০২৮৪, আল মু'জামুল কাবীর লিত্ব ত্ববারানী ২৯৪, আল মু'জামুল আওসাত্ব ৫৭৮।"
}
]
function getRandomQuote () {
	var randomNumber = Math.floor(Math.random() * (hadiths.length));
	var randomQuote = hadiths[randomNumber];
	return randomQuote;
	console.log(randomNumber);
	console.log(randomQuote);
}	

function getRandomColor () {
	var red = Math.floor(Math.random() * 256 );
	var green = Math.floor(Math.random() * 256 );
	var blue = Math.floor(Math.random() * 256 );
	 var randomColor = 'rgb(' + red + ',' + green + ',' + blue + ')';
	return randomColor;
}


function printQuote () {
		var quotes = getRandomQuote ();
				if (quotes.reference){
				    h3reference.innerHTML= `${quotes.reference}`;
				}
		if (quotes.reference == null){
				    h3reference.innerHTML= "";
				}
				
				if (quotes.Description) {
				    BanglaBornona.innerHTML=`${quotes.Description}`;
				}
				if(quotes.arabic){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML=`${quotes.arabic}`;
				}
				if(quotes.arabic == null){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML="";}
				else {
				    console.log("Nothing");
				}
				refreshicon.style.backgroundColor=getRandomColor ();
}


        
        
        
        
    }
    if(event.target.value == "illness"){
        console.log("Illnes Option");
 var refreshicon = document.getElementById("refreshicon");
 refreshicon.addEventListener("click",printQuote);
 var illness = [
     {
         Description : "রোগ-ব্যাধির মাধ্যমে আল্লাহ গুনাহ মাফ করেন শুধু রোগ-ব্যাধি কেন মুমিনের যেকোনো দুঃখ-কষ্টের বিনিময়ে মহান আল্লাহ তাকে পাপমুক্ত করেন। আবু হুরায়রা (রা.) থেকে বর্ণিত, নবী (সা.) বলেছেন, মুসলিম ব্যক্তির ওপর যে কষ্ট ক্লেশ, রোগ-ব্যাধি, উদ্বেগ-উত্কণ্ঠা, দুশ্চিন্তা, কষ্ট ও পেরেশানি আসে, এমনকি যে কাঁটা তার দেহে ফোটে, এসবের মাধ্যমে আল্লাহ তার গুনাহসমূহ ক্ষমা করে দেন। ",
reference : "(বুখারি, হাদিস : ৫৬৪১)"
     },
     {
     Description : "মুমিনের যেকোনো দুঃখ-কষ্টের বিনিময়ে মহান আল্লাহ তাকে পাপমুক্ত করেন। আবু হুরায়রা (রা.) থেকে বর্ণিত, নবী (সা.) বলেছেন, মুসলিম ব্যক্তির ওপর যে কষ্ট ক্লেশ, রোগ-ব্যাধি, উদ্বেগ-উত্কণ্ঠা, দুশ্চিন্তা, কষ্ট ও পেরেশানি আসে, এমনকি যে কাঁটা তার দেহে ফোটে, এসবের মাধ্যমে আল্লাহ তার গুনাহসমূহ ক্ষমা করে দেন। (বুখারি, হাদিস : ৫৬৪১), তবে শর্ত হলো, বিপদে আল্লাহর ওপর পূর্ণ ভরসা রাখতে হবে। পবিত্র কোরআনে মহান আল্লাহ বলেন, ‘আর আমি অবশ্যই তোমাদের পরীক্ষা করব, কিছু ভয়, ক্ষুধা এবং জান-মাল ও ফল-ফলাদির স্বল্পতার (ক্ষতি) মাধ্যমে। আর তুমি ধৈর্যশীলদের সুসংবাদ দাও।’ (সুরা বাকারা, আয়াত : ১৫৫)",

      reference : "[(বুখারি, হাদিস : ৫৬৪১),(সুরা বাকারা, আয়াত : ১৫৫)]"
     },
     {
         Description : "আল্লাহ তাআলার এই পরীক্ষার পরিধি হয় মানুষের ঈমানের ওপর ভিত্তি করে। মহান আল্লাহ কখনো কখনো কঠিন বিপদ দিয়েও পরীক্ষা করেন। যার ঈমান যত বেশি তার পরীক্ষাও তত বড় হয়। রাসুল (সা.) বলেন, আল্লাহ যে ব্যক্তির কল্যাণ কামনা করেন, তাকে তিনি দুঃখ-কষ্টে পতিত করেন। (বুখারি, হাদিস : ৫৬৪৫),তাই প্রতিটি মুমিনের উচিত দুঃখ-কষ্ট ও রোগ-ব্যাধিতে হতাশ না হয়ে মহান আল্লাহর ওপর পূর্ণ আস্থা রাখা। তার কাছে সাহায্য চাওয়া এবং ধৈর্যের সাথে পরিস্থিতি মোকাবিলা করার চেষ্টা করা।",

reference : "(বুখারি, হাদিস : ৫৬৪৫)"
     },
     {
         Description : "আমাদের প্রিয় নবী (সা.)-ও মাঝে মাঝে অসুস্থ হয়েছেন। বিপদ-মুসিবতের মুখোমুখি হয়েছেন। কিন্তু কখনো ধৈর্য হারাননি। ঈমান ও ইসলামের দাওয়াতের পথ থেকে বিচ্যুৎ হননি। উম্মুল মুমিনিন হজরত আয়েশা (রা.) থেকে বর্ণিত, তিনি বলেন যে, আমি রাসুলুল্লাহ (সা.)-এর চেয়ে বেশি রোগ যন্ত্রণা ভোগকারী অন্য কেউকে দেখিনি। (বুখারি, হাদিস : ৫৬৪৬)",

     reference : "(বুখারি, হাদিস : ৫৬৪৬)"
     },
     {
         Description : "সুস্থতা-অসুস্থতা আল্লাহরই নেয়ামত।  সুস্থতা যেমন আল্লাহর নেয়ামত ঠিক তেমনি অসুস্থতাও আল্লাহর নেয়ামত। ঠিক তেমনিভাবে অসুস্থতাও আল্লাহতায়ালার নেয়ামত। বিভিন্ন হাদিসে রোগ-শোক ও বালা-মুসিবতের তাৎপর্য ও ফজিলত বর্ণিত হয়েছে। অসুস্থতা দেহের জাকাতস্বরূপ। এর দ্বারা শরীর গুনাহমুক্ত হয়, পাক-পবিত্র হয়। আল্লাহর কাছে বান্দার মর্যাদা বুলন্দ হয়। ভবিষ্যত জীবনের জন্য উপদেশ গ্রহণের সুযোগ তৈরি হয়। এক হাদিসে বর্ণিত হয়েছে, ‘কিয়ামতের দিন বিপদগ্রস্ত লোকদেরকে যে মহাপুরস্কার দেওয়া হবে তা দেখে আফিয়াতের অধিকারী লোকেরা কামনা করবে, হায়! দুনিয়াতে যদি তাদের দেহ কাঁচি দিয়ে কেটে টুকরো টুকরো করা হতো (আর তার বিনিময়ে আখেরাতের এ মহাপুরস্কার লাভ হতো)।’ (জামে তিরমিযি, হাদিস নং-২৪০২),অসুস্থতা মুমিনের জন্য গজব নয়, বরং নেয়ামতস্বরূপ। মুমিনের কাছে যখন অসুস্থতা আসে আর সে ধৈর্য ধরে তখন এর ফল অসাধারণ হয় আল্লাহর পক্ষ হতে। আল্লাহ বলেন, ‘অবশ্যই আমি তোমাদেরকে পরীক্ষা করব কিছুটা ভয়, ক্ষুধা, জান ও মালের ক্ষতি ও ফল-ফসল বিনষ্টের মাধ্যমে।’ (সুরা বাকারা, আয়াত-১৫৬)",

reference :"জামে তিরমিযি, হাদিস নং-২৪০২),সুরা বাকারা, আয়াত-১৫৬)"
     },
     {
Description : "সূরা ফাতিহা পড়ে,যে ব্যক্তি আল্লাহর কাছে রোগের শেফা চাইবে। আল্লাহ তাকে ওই রোগ থেকে শেফা(আরোগ্য)করবেন,ইনশাআল্লাহ।",
reference :"[বুখারী ২২৭৬]"
}
     ]
        
        
function getRandomQuote () {
	var randomNumber = Math.floor(Math.random() * (illness.length));
	var randomQuote = illness[randomNumber];
	return randomQuote;
	console.log(randomNumber);
	console.log(randomQuote);
}	

function getRandomColor () {
	var red = Math.floor(Math.random() * 256 );
	var green = Math.floor(Math.random() * 256 );
	var blue = Math.floor(Math.random() * 256 );
	 var randomColor = 'rgb(' + red + ',' + green + ',' + blue + ')';
	return randomColor;
}


function printQuote () {
		var quotes = getRandomQuote ();
				if (quotes.reference){
				    h3reference.innerHTML= `${quotes.reference}`;
				}
		if (quotes.reference == null){
				    h3reference.innerHTML= "";
				}
				
				if (quotes.Description) {
				    BanglaBornona.innerHTML=`${quotes.Description}`;
				}
				if(quotes.arabic){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML=`${quotes.arabic}`;
				}
				if(quotes.arabic == null){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML="";}
				refreshicon.style.backgroundColor=getRandomColor ();
}

    }
    
    
    
    if(event.target.value == "angry"){
        console.log("Angry Option");
        
 var refreshicon = document.getElementById("refreshicon");
refreshicon.addEventListener("click",printQuote);
  var Angry = [
{
Description : "আয়েশা (রা.) বলেন, একবার রাসুলুল্লাহ (স.) আমাকে বলেন, ‘আমি তোমার রাগ ও অনুরাগ বুঝতে পারি।’ আমি জিজ্ঞাসা করলাম, ‘আল্লাহর রাসুল! কিভাবে বুঝতে পারেন?’ তিনি বলেন, ‘তুমি যখন আমার ওপর সন্তুষ্ট থাকো, তখন বলে থাকো—‘বালা ওয়া রাব্বি মুহাম্মদ’ (মুহাম্মদের রবের কসম!...) আর অসন্তুষ্ট হলে বলে থাকো—‘লা ওয়া রাব্বি ইবরাহিম’ (ইবরাহিমের রবের কসম!...। )’ আমি বললাম, ‘আল্লাহর রাসুল! আপনি ঠিক বলেছেন। তবে আমি শুধু আপনার নামটিই ত্যাগ করি। (অন্তর আপনার ভালোবাসায় পূর্ণ থাকে।’)",
reference : "[বুখারি: ৫২২৮]"
},
{
Description : "রাসুলুল্লাহ (সা.) বলেন, ‘যখন তোমাদের কারো রাগ হয় তখন সে যদি দাঁড়ানো থাকে, তবে যেন বসে পড়ে। যদি তাতে রাগ চলে যায় ভালো। আর যদি না যায়, তবে শুয়ে পড়বে।",
reference : "[আবু দাউদ, হাদিস : ৪৭৮৪]"
},
{
Description : "রাসুল (সা.) ইরশাদ করেন, ‘নিশ্চয়ই রাগ শয়তানের পক্ষ থেকে। আর শয়তান আগুনের তৈরি। নিশ্চয়ই পানির দ্বারা আগুন নির্বাপিত হয়। সুতরাং তোমাদের কেউ যখন রাগান্বিত হয় সে যেন অজু করে।",
reference : "[আবু দাউদ, হাদিস : ৪৭৮৬]"
},
{
Description : "দুই ব্যক্তি রাসুল (সা.)-এর কাছে বসে পরস্পর গালাগাল করছিল। তাদের একজনের চোখ লাল হয়ে উঠল ও গলার শিরা ফুলে গেল। তখন রাসুলুল্লাহ (সা.) বলেন, ‘আমি একটি বাক্য জানি, যদি সে তা পড়ে তবে তার এ অবস্থা কেটে যাবে। সে বাক্যটি হলো, আমি আল্লাহর কাছে অভিশপ্ত শয়তান থেকে আশ্রয় প্রার্থনা করছি। [অর্থাৎ আউজু বিল্লাহি মিনাশ শাইত্বানির রাজিম,পড়া]",
reference : "[মুসলিম, হাদিস : ৬৮১২]"
},
{
Description : "রাগ বা ঝগড়ার সময় আউজু বিল্লাহি মিনাশ শাইত্বানির রাজিম পড়ার মাধ্যমে শয়তান পালিয়ে যায়, ফলে রাগ ও ঝগড়া কমে যায়। এ ছাড়া অজুর মাধ্যমে রাগ নিয়ন্ত্রণ করা সম্ভব। রসুল (সা.) বলেছেন, ‘নিশ্চয়ই রাগ শয়তানের পক্ষ থেকে। আর শয়তান আগুনের তৈরি। নিশ্চয়ই পানির দ্বারা আগুন নির্বাপিত হয়। সুতরাং তোমাদের কেউ যখন রাগান্বিত হয় সে যেন অজু করে (আবু দাউদ)।",
reference :"[আবু দাউদ]"
},
{
Description : "আউযু বিল্লাহি মিনাশ শাইত্বানির রাজীম’ পড়লে ক্রোধ/রাগ ঠান্ডা হয়ে যায়।",
reference : "[বুঃ ১০/৩৮৯, মুঃ ২৬১০]"
},
{
Description : "ক্রোধ এলে যদি কেউ দাঁড়িয়ে থাকে, তবে বসে যাবে এবং বসে থাকলে শুয়ে যাবে।",
reference :"[আঃ দাঃ ৪৭৮২, সঃ জাঃ ৭০৭]"
},
{
Description : "রাসুলুল্লাহ (সা.) বলেন, ‘তোমরা শিক্ষা দাও এবং সহজ করো। কঠিন করো না। যখন তুমি রাগান্বিত হও তখন চুপ থাকো; যখন তুমি রাগান্বিত হও তখন চুপ থাকো; যখন তুমি রাগান্বিত হও তখন চুপ থাকো।",
reference : "(মুসনাদে আহমদ, হাদিস : ৪৭৮৬)"
}
]
function getRandomQuote () {
	var randomNumber = Math.floor(Math.random() * (Angry.length));
	var randomQuote = Angry[randomNumber];
	return randomQuote;
	console.log(randomNumber);
	console.log(randomQuote);
}	

function getRandomColor () {
	var red = Math.floor(Math.random() * 256 );
	var green = Math.floor(Math.random() * 256 );
	var blue = Math.floor(Math.random() * 256 );
	 var randomColor = 'rgb(' + red + ',' + green + ',' + blue + ')';
	return randomColor;
}


function printQuote () {
		var quotes = getRandomQuote ();
				if (quotes.reference){
				    h3reference.innerHTML= `${quotes.reference}`;
				}
		if (quotes.reference == null){
				    h3reference.innerHTML= "";
				}
				
				if (quotes.Description) {
				    BanglaBornona.innerHTML=`${quotes.Description}`;
				}
				if(quotes.arabic){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML=`${quotes.arabic}`;
				}
				if(quotes.arabic == null){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML="";}
				else {
				    console.log("Nothing");
				}
				refreshicon.style.backgroundColor=getRandomColor ();
}
        
        
        
        
    }
    if(event.target.value == "wishes"){
        console.log("Wishesh Option");
        
        var refreshicon = document.getElementById("refreshicon");
refreshicon.addEventListener("click",printQuote);
  var wishes = [
{
Description : "প্রত্যেক কাজ নিয়তের উপর নির্ভরশীল। আর মানুষ তার নিয়ত অনুযায়ী প্রতিফল পাবে।",
reference : "[সহিহ বুখারী ১]"
},
{
 Description : "আলক্বামাহ ইবনু ওয়াক্কাস আল-লায়সী (রহ.) হতে বর্ণিত। আমি ’উমার ইবনুল খাত্তাব (রাঃ)-কে মিম্বারের উপর দাঁড়িয়ে বলতে শুনেছিঃ আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ কাজ (এর প্রাপ্য হবে) নিয়্যাত অনুযায়ী। আর মানুষ তার নিয়্যাত অনুযায়ী প্রতিফল পাবে। তাই যার হিজরত হবে ইহকাল লাভের অথবা কোন মহিলাকে বিবাহ করার উদ্দেশে- তবে তার হিজরত সে উদ্দেশেই হবে, যে জন্যে, সে হিজরত করেছে।",
reference : "(৫৪, ২৫২৯, ৩৮৯৮, ৫০৭০, ৬৬৮৯, ৬৯৫৩; মুসলিম ২৩/৪৫ হাঃ ১৯০৭, আহমাদ ১৬৮) ( আধুনিক প্রকাশনী- ১, ইসলামিক ফাউন্ডেশন ১)"
},
{
    Description : "রাসূলুল্লাহ ﷺ বলেছেন: যে ব্যক্তি কোনো ভালো কাজের পথ দেখায়, সে উক্ত কাজ সম্পাদনকারীর সমপরিমাণ সওয়াব পায়।",
    reference : "[সুনান আবূ দাউদ: ৫১২৯]"
},
{
    Description : "যে ব্যক্তি কোনো ভালো কাজের সংকল্প করে, কিন্তু তা সম্পাদন করেননি, আল্লাহ তার আমলনামায় একটি পূর্ণ সাওয়াব বা প্রতিদিন লেখার আদেশ দেন। আর (ভালো কাজের) সংকল্প করার পর যদি কাজটি বাস্তবায়ন করা হয়, তবে আল্লাহ তার আমলনামায় ১০ নেকি থেকে শুরু করে ৭০০; এমনকি তার চেয়েও কয়েকগুণ বেশি সাওয়াব দান করেন। পক্ষান্তরে... যদি কোনো মানুষ মন্দ কাজের ইচ্ছা পোষণ করে, সঙ্গে সঙ্গে তার আমলনামায় গোনাহ লেখা হয় না। তবে যখন সে ব্যক্তি মন্দ কাজ করে তখন শুধু মাত্র একটি মন্দ কাজের জন্য একটি গোনাহ লেখা হয়।’(বুখারি ও মুসলিম)",
    reference: "[বুখারী ও মুসলিম]"
}
]
function getRandomQuote () {
	var randomNumber = Math.floor(Math.random() * (wishes.length));
	var randomQuote = wishes[randomNumber];
	return randomQuote;
	console.log(randomNumber);
	console.log(randomQuote);
}	

function getRandomColor () {
	var red = Math.floor(Math.random() * 256 );
	var green = Math.floor(Math.random() * 256 );
	var blue = Math.floor(Math.random() * 256 );
	 var randomColor = 'rgb(' + red + ',' + green + ',' + blue + ')';
	return randomColor;
}


function printQuote () {
		var quotes = getRandomQuote ();
				if (quotes.reference){
				    h3reference.innerHTML= `${quotes.reference}`;
				}
		if (quotes.reference == null){
				    h3reference.innerHTML= "";
				}
				
				if (quotes.Description) {
				    BanglaBornona.innerHTML=`${quotes.Description}`;
				}
				if(quotes.arabic){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML=`${quotes.arabic}`;
				}
				if(quotes.arabic == null){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML="";}
				else {
				    console.log("Nothing");
				}
				refreshicon.style.backgroundColor=getRandomColor ();
}
    }
    
    
    if(event.target.value == "rijk"){
        console.log("Rijk Option");
var refreshicon = document.getElementById("refreshicon");
refreshicon.addEventListener("click",printQuote);
  var rijk = [
   {
       Description :" হজরত ওমর (রা.) বলেছেন, ‘আমি রাসুলুল্লাহকে (সা.) বলতে শুনেছি, যদি তোমরা আল্লাহর প্রতি যথাযথভাবে ভরসা রাখো। তিনি তোমাদের সেভাবে রিজিক দান করবেন, যেভাবে তিনি পাখিদের দান করে থাকেন। পাখিরা সকালে খালি পেটে নীড় থেকে বের হয়, আর সন্ধ্যায় উদর পূর্ণ করে নীড়ে ফেরে।’ (তিরমিজি, হাদিস: ২৩৪৪; ইবন মাজাহ, হাদিস: ৪১৬৪)",
       reference :"(তিরমিজি, হাদিস: ২৩৪৪; ইবন মাজাহ, হাদিস: ৪১৬৪)"
   },
   {
       Description : "আবদুল্লাহ ইবনে মাসউদ (রা.) বর্ণনা করেছেন যে রাসুলুল্লাহ (সা.) বলেছেন, ‘আপন আপন মাতৃগর্ভে তোমরা প্রত্যেকেই চল্লিশ দিন পর্যন্ত (শুক্র হিসেবে) জমা ছিলে। তারপর চল্লিশ দিন রক্তপিণ্ড হিসেবে, এরপর চল্লিশ দিন গোশতের পিণ্ড হিসেবে জমা ছিলে। এরপর আল্লাহ–তাআলা একজন ফেরেশতা পাঠান এবং বান্দার রিজিক, মৃত্যু, দুর্ভাগ্য ও সৌভাগ্য—এ চারটি বিষয় লেখার আদেশ প্রদান করেন।’ (বুখারি, হাদিস: ৬৫৯৪)",
       reference: "(বুখারি, হাদিস: ৬৫৯৪)"
   },
   {
       Description : "ইবনু মাস্’ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, সত্যবাদী ও সত্যবাদী বলে স্বীকৃত আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের প্রত্যেকেরই জন্ম হয় এভাবে যে, তার মায়ের পেটে (প্রথমে তার মূল উপাদান) শুক্ররূপে চল্লিশ দিন পর্যন্ত থাকে। অতঃপর তা চল্লিশ দিন পর্যন্ত লাল জমাট রক্তপিন্ডরূপ ধারণ করে। তারপর পরবর্তী চল্লিশ দিনে মাংসপিন্ডর রূপ ধারণ করে। অতঃপর আল্লাহ তা’আলা একজন মালাককে চারটি বিষয় লিখে দেয়ার জন্য পাঠন। সে মালাক লিখেন তার- (১) ’আমল [সে কি কি ’আমল করবে], (২) তার মৃত্যু, (৩) তার রিয্‌ক্ব (রিজিক/রিযিক) ও (৪) তার নেককার বা দুর্ভাগা হওয়ার বিষয় আল্লাহর হুকুমে তার তাক্বদীরে লিখে দেন, তারপর তন্মধ্যে রূহ্ প্রবেশ করান। অতঃপর সে সত্তার কসম, যিনি ব্যতীত প্রকৃত আর কোন ইলাহ নেই! তোমাদের মধ্যে কেউ জান্নাতবাসীদের ’আমল করতে থাকে, এমনকি তার ও জান্নাতের মধ্যে মাত্র এক হাত দূরত্ব থাকে, এমন সময় তার প্রতি তাক্বদীরের লিখা তার সামনে আসে। আর তখন সে জাহান্নামীদের কাজ করতে থাকে এবং জাহান্নামে প্রবেশ করে। তোমাদের কোন ব্যক্তি জাহান্নামীদের মতো ’আমল করতে শুরু করে, এমনকি তার ও জাহান্নামের মধ্যে এক হাত দূরত্ব অবশিষ্ট থাকে। এমন সময় তার প্রতি সে লেখা (তাক্বদীর) সামনে আসে, তখন সে জান্নাতীদের কাজ করতে শুরু করে, ফলে সে জান্নাতে প্রবেশ করে। (বুখারী, মুসলিম)[1]  সহীহ : বুখারী ৩২০৮, মুসলিম ২৬৪৩, আবূ দাঊদ ৪৭০৮, ইবনু মাজাহ ৭৬, তিরমিযী ২১৩৭, সহীহ ইবনু হিব্বান ৬১৭৪, আহমাদ ৩৯৩৪।",
       reference : "। (বুখারী, মুসলিম)[1]  সহীহ : বুখারী ৩২০৮, মুসলিম ২৬৪৩, আবূ দাঊদ ৪৭০৮, ইবনু মাজাহ ৭৬, তিরমিযী ২১৩৭, সহীহ ইবনু হিব্বান ৬১৭৪, আহমাদ ৩৯৩৪।"
      },
      {
          Description : "মহান আল্লাহ তায়ালা সুবহে সাদিক থেকে সূর্যোদয় পর্যন্ত রিজিক বন্টন করে থাকেন ।  ",
          reference : "[আত-তারগিব ২৬১৬]"
      },
      {
          Description : "নবীজি আরও বলেছেন,সকাল বেলা রিজিকের অন্বেষণ করো। কেননা সকাল বেলা বরকত’ময় ও সফলতা অর্জনের উপযুক্ত সময়।",
          reference : "[মাজমাউস জাওয়ায়েদ ৬২২০]"
      },
      {
          Description : "রিজিক বলতে মানুষ কেবল অর্থ,সম্পদ,টাকা পয়সা'কে বুঝলে,মূলত এগুলো কেবল রিজিকের সর্বনিম্ন স্তরের। রিজিকের সর্বনিম্ন স্তর হচ্ছে,টাকা, পয়সা, অর্থ এবং সম্পদ। রিজিক এর সর্বোচ্চ স্তর হচ্ছেঃ শারীরিক এবং মানসিক সুস্থতা।রিজিকের সর্বোত্তম স্তর হচ্ছেঃ পুণ্যবান স্ত্রী এবং পরিশুদ্ধ নেক সন্তান এবং রিজিকের পরিপূর্ণ স্তর হচ্ছেঃ মহান আল্লাহর সন্তুষ্টি।আপনি আপনার পুরো জীবনে কত টাকা আয় করবেন, সেটা লিখিত, কে আপনার জীবনসঙ্গী হবে সেটা লিখিত, আপনি কবে কোথায় মারা যাবেন যা সেটাও লিখিত এবং কতটা খাবার ও পানীয় গ্রহণ করবেন তাও লিখিত বা নির্দিষ্ট। এবং লেখার পরে,কলম তুলে নেওয়া হয়েছে, কালি শুকিয়ে গিয়েছে। যেটা রিজিকে নির্ধারিত হয়েগেছে,মহান আল্লাহ তায়ালা আপনার রিজিকে লিখেছেন,সেটা আপনি পাবেন'ই ইনশাআল্লাহ। সেটা না পেয়ে আপনি মারা যাবেন না ইনশাআল্লাহ। অন্যকেউ হাজার চেষ্টা করেও সেটা পাবেনা,যেটা আপনার রিজিকে লেখা হয়েছে বা হয়ে গেছে। সুবাহাআল্লাহ। ❤️"
      },
      {
          Description : "আপনি যেই ফলটি আজকে টেকনাফ বসে খাচ্ছেন, সেটা হয়ত ইতালি কিংবা থাইল্যান্ড থেকে ইমপোর্ট করা। ওই গাছে যখন মুকুল ধরেছে তখনই নির্ধারিত হয়েছে যে, সেটি আপনার কাছে পৌঁছাবে। এর মধ্যে কত পাখি ওই ফলের উপর বসেছে, কত মানুষ এই ফলটি পাড়তে গেছে, দোকানে অনেকে এই ফলটি নেড়েচেড়ে রেখে গেছে, পছন্দ হয়’নি বা কিনেনি। এই সব ঘটনার কারণ একটাই, ফলটি আপনার তাক্বদীরে লিখিত। যতক্ষণ না আপনি কিনতে যাচ্ছেন, ততক্ষণ সেটা ওখানেই থাকবে। এর মধ্যে আপনি মারা যেতে পারতেন, অন্য কোথাও চলে যেতে পারতেন, কিন্তু না! রিজকে যেহেতু লিখিত আপনি এই ফলটি না খেয়ে মারা যাবো না। রিজিক জিনিসটা এতোটাই শক্তিশালী! সুবহানআল্লাহ ❤️"
      },
      {
          Description : "ধরুন, এটা লিখিত যে আপনি সারাজীবনে এক কোটি টাকা আয় করবেন, এই সিদ্ধান্ত আল্লাহ্‌ তা'আলা নিয়েছেন। কিন্তু, আপনি হালাল উপায়ে আয় করবেন নাকি হারাম উপায়ে আয় করবেম, সেই সিদ্ধান্ত একান্তই আপনার। যদি ধৈর্য ধারণ করেন,আল্লাহর উপর তাওয়াক্কুল করেন, আল্লাহ্‌ তা'আলার কাছে চান, তাহলে হালাল উপায়ে ওই এক কোটি টাকা আয় করেই আপনি মারা যাবেন। আর হারাম উপায়ে হলেও ওই এক কোটিই... নাথিং মোর, নাথিং লেস!এক টাকা বেশিও না,এক টাকা কম’ও না। সুবহানআল্লাহ। 💜💟"
      },
      {
          Description : "তাকদির নিয়ে একটি গল্প;-একবার এক গ্রামে এক রাখাল মাঠে ভেড়া চড়াতো,তো সেই মাঠের পাশে ছিল একটি পুরাতন কুয়ো। সেই পাশেই রাখাল দাঁড়িয়ে ছিল, রাখালটি হঠাৎ আকস্মিক'ভাবে কুয়োতে পরে গেল,জান বাঁচাতে;- বাঁচাও বাঁচাও বলে চিৎকার চেঁচামেচি করতেছিল।হইচই আর চেঁচামেচি’তে পুরো গ্রামের মানুষ এসে খুব কষ্ট করে সেই রাখাল লোকটিকে বাঁচাল। রাখাল লোকটি ভয়ে প্রায় শক্তিহীন হয়ে গেছিল,শক্তিহীন রুঢ়'লোকটি যেন শক্তি পায়, এবং স্বাভাবিকতা ফিরে পায় সেই জন্য,  লোকটি'কে কুয়ো থেকে তুলেই এক গ্লাস ছাগি'র(ছাগলের বাচ্চা) দুধ পান করালো। লোকটি স্বাভাবিক অবস্থায় ফিরে এলো,লোকটি কথা বলার মতো শক্তি সঞ্চিত হলো।  তখন গ্রামের লোক বলল,ওহে রাখাল,তুমি কিভাবে এই পুরাতন কুয়োতে পড়ে গিয়েছিলে,সেই রাখাল লোকটি বর্ণনা সহ দেখাতে গিয়ে,হুট করে কুয়োর ভিতর পড়ে গিয়ে ঘাড় মটকায় মারা গেল। গ্রামের মানুষ খুব'ই অনুশুচনা করতে লাগলো,পাশেই ছিল মসজিদের ইমাম ,তো গ্রামের লোক ইমাম সাব'কে জিজ্ঞাস করলো,এমন ঘটনার কারণ কি হতে পারে,তখন সেই ইমাম বলল,যে আসলে ওওর মৃত্যুর সময় এসেছিল,কিন্তু তার রিজিক ফুরিয়ে যায়নি, ওই ছাকির দুধ রিজিকে রয়ে গিয়েছিল। অতঃপর  সে তার অবশিষ্ট বিদ্যমান থাকা ছাগির দুধ পান করলো,এবং তার উক্ত রিজিক প্রাপ্ত হয়েই সে মারা গেল।  সুতরাং রিজিক নিয়ে হতাশ হয়েন না,যেটা আপনার ভাগ্যে লিখিত সেটা আপনি পাবেন,আর যেটা ভাগ্য লেখা নাই,সেটা কশ্মিন কালেও পাবেন না। আল্লাহর উপর তাওয়াক্কুল করুন,যিনি আমাদের রব, যিনি সৃষ্টি করেছেন সবকিছু,নিশ্চয় তিনি সর্বোত্তম পরিকল্পনাকারী। আপনার পরিকল্পনা/চিন্তা একটি ফুল হলে,মহান আল্লাহ তায়ালা’র পরিকল্পনা একটু ফুলের বাগান। সুবাহাআল্লাহ। ❤️"
      }
]
function getRandomQuote () {
	var randomNumber = Math.floor(Math.random() * (rijk.length));
	var randomQuote = rijk[randomNumber];
	return randomQuote;
	console.log(randomNumber);
	console.log(randomQuote);
}	

function getRandomColor () {
	var red = Math.floor(Math.random() * 256 );
	var green = Math.floor(Math.random() * 256 );
	var blue = Math.floor(Math.random() * 256 );
	 var randomColor = 'rgb(' + red + ',' + green + ',' + blue + ')';
	return randomColor;
}


function printQuote () {
		var quotes = getRandomQuote ();
				if (quotes.reference){
				    h3reference.innerHTML= `${quotes.reference}`;
				}
		if (quotes.reference == null){
				    h3reference.innerHTML= "";
				}
				
				if (quotes.Description) {
				    BanglaBornona.innerHTML=`${quotes.Description}`;
				}
				if(quotes.arabic){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML=`${quotes.arabic}`;
				}
				if(quotes.arabic == null){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML="";}
				else {
				    console.log("Nothing");
				}
				refreshicon.style.backgroundColor=getRandomColor ();
}
        
        
        
        
        
    }
    if(event.target.value == "satisfied"){
        console.log("satisfied Option");
    var refreshicon = document.getElementById("refreshicon");
        refreshicon.addEventListener("click",printQuote);


var hadidths = [
{
Description : "রাসুলুল্লাহ (সা.) বলেছেন, কোনো আদম সন্তানের অধীনে যদি দুই উপত্যকা ভর্তি স্বর্ণ থাকে, তবু সে তৃতীয় একটি স্বর্ণ ভর্তি উপত্যকা অর্জনের ইচ্ছা করবে। মাটি ব্যতীত অন্য কিছুই তার মুখ ভর্তি করতে পারবে না।",
reference : "(তিরমিজি, হাদিস ২৩৩৭)"
},
{
Description : " রাসুলুল্লাহ (সা.) বলেছেন, ‘যে ব্যক্তি ইসলামের দিকে হেদায়েতপ্রাপ্ত হয়েছে, যাকে প্রয়োজন মাফিক রিজিক প্রদান করা হয়েছে এবং যে তাতেই পরিতুষ্ট থাকে, সে-ই সফলকাম হয়েছে।",
reference : "[ইবনে মাজাহ, হাদিস ৪১৩৮]"
},{
Description : "রাসুলুল্লাহ (সা.) বলেন, মায়ের গর্ভে একজন ফিরিশতা প্রেরণ করা হয়, সে নবজাতকের মধ্যে আত্মা ফুঁকে দেয়। এবং আল্লাহর পক্ষ থেকে চারটি অধ্যাদেশ জারি করে।(১)সে কী পরিমাণ রিজিক পাবে। (২)তার দুনিয়াতে অবস্থানকাল কতটুকু।(৩) তার আমল কেমন হবে।(৪) সে সৌভাগ্যবান না দুর্ভাগা।",
reference :"[বুখারি, হাদিস ৭৪৫৩]"
}
  ]

function getRandomQuote () {
	var randomNumber = Math.floor(Math.random() * (hadidths.length));
	var randomQuote = hadidths[randomNumber];
	return randomQuote;
	console.log(randomNumber);
	console.log(randomQuote);
}	

function getRandomColor () {
	var red = Math.floor(Math.random() * 256 );
	var green = Math.floor(Math.random() * 256 );
	var blue = Math.floor(Math.random() * 256 );
	 var randomColor = 'rgb(' + red + ',' + green + ',' + blue + ')';
	return randomColor;
}


function printQuote () {
		var quotes = getRandomQuote ();
				if (quotes.reference){
				    h3reference.innerHTML= `${quotes.reference}`;
				}
	if (quotes.reference == null){
		h3reference.innerHTML= "";
				}
				
				if (quotes.Description) {
				    BanglaBornona.innerHTML=`${quotes.Description}`;
				}
				
	if(quotes.arabic){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML=`${quotes.arabic}`;
				}
	if(quotes.arabic == null){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML="";}
	
	
				else {
				    console.log("Nothing");
				}
				refreshicon.style.backgroundColor=getRandomColor ();
}
        
        
        
        
    }
    if(event.target.value == "sabr"){
        console.log("Sabr Option click");

var refreshicon = document.getElementById("refreshicon");
refreshicon.addEventListener("click",printQuote);
 var sabr = [
     {
         Description : "কোরআনুল কারিমে আল্লাহ তাআলা বলেন, ‘ইয়া আইয়ুহাল্লাজিনা আমানুছতাঈনু বিছছবরি ওয়াছ ছলাতি; ইন্নাল্লাহা মাআছ ছাবিরিন।’ অর্থ: হে মুমিনগণ! ধৈর্য ও সালাতের মাধ্যমে তোমরা সাহায্য প্রার্থনা করো। নিশ্চয়ই আল্লাহ ধৈর্যশীলদের সঙ্গে আছেন। (পারা: ২, সূরা-২ বাকারা, আয়াত: ১৫৩)।",
reference : "[(পারা: ২, সূরা-২ বাকারা, আয়াত: ১৫৩)]"
     },
     {
Description : "আবূ হুরাইরাহ রাদিয়াল্লাহু ‘আনহু কর্তৃক বর্ণিত, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘‘আল্লাহ তা‘আলা বলেন, ‘আমার মু’মিন বান্দার জন্য আমার নিকট জান্নাত ব্যতীত অন্য কোন পুরস্কার নেই, যখন আমি তার দুনিয়ার প্রিয়তম কাউকে কেড়ে নই এবং সে সওয়াবের নিয়তে সবর করে।’’[1]",
reference : "[[1] সহীহুল বুখারী ১২৫২, ১২৮৩, ১৩০২, ৭১৫৪, মুসলিম ৯২৬, তিরমিযী ৯৮৮, নাসায়ী ১৮৬৯, আবূ দাউদ ৩১২৪, ইবনুূু মাজাহ ১৫৯৬, আহমাদ ১১৯০৮, ১২০৪৯, ১২৮৬০।]"
     },
     {
         Description : "অর্থাৎ “নিশ্চয়ই আমি তোমাদেরকে কিছু ভয় ও ক্ষুধা দ্বারা এবং কিছু ধনপ্রাণ এবং ফলের (ফসলের) লোকসান দ্বারা পরীক্ষা করব; আর তুমি ধৈর্যশীলদেরকে সুসংবাদ দাও।” (সূরা বাকারাহ ১৫৫ আয়াত)",
         reference : "[সূরা বাকারাহ, ১৫৫ আয়াত ]"
     },
     {
         Description : "অর্থাৎ “ধৈর্যশীলদেরকে তো অপরিমিত পুরস্কার দেওয়া হবে।” (সূরা যুমার ১০ আয়াত",
         reference : "[সূরা যুমার আয়াত ১০]"
     },
     {
         Description : "অর্থাৎ “অবশ্যই যে ধৈর্য ধারণ করে এবং ক্ষমা করে, নিশ্চয় তা দৃঢ়-সংকল্পের কাজ।",
         reference :"[সূরা শুরা, ৪৩ আয়াত]"
     },
     {
         Description : "অর্থাৎ “হে বিশ্বাসীগণ! তোমরা ধৈর্য ও নামাযের মাধ্যমে সাহায্য প্রার্থনা কর। নিশ্চয় আল্লাহ ধৈর্যশীলদের সঙ্গে থাকেন।” (সূরা বাকারাহ ১৫৩ আয়াত)",
         reference : "[সূরা বাকারাহ, ১৫৩ আয়াত]"
     },
     {
         Description : "আবূ ইয়াহয়া সুহাইব ইবনু সিনান রাদিয়াল্লাহু ‘আনহু থেকে বর্ণিত আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ‘‘মুমিনের ব্যাপারটাই আশ্চর্যজনক। তার প্রতিটি কাজে তার জন্য মঙ্গল রয়েছে। এটা মু’মিন ব্যতীত অন্য কারো জন্য নয়। সুতরাং তার সুখ এলে আল্লাহর কৃতজ্ঞতা প্রকাশ করে। ফলে এটা তার জন্য মঙ্গলময় হয়। আর দুঃখ পৌঁছলে সে ধৈর্য ধারণ করে। ফলে এটাও তার জন্য মঙ্গলময় হয়।’’[1]",
         reference : "[ [1] সহীহুল বুখারী ১৪৬৯, ৬৪৭০, মুসলিম ১০৫৩, তিরমিযী ২০২৪, নাসায়ী ২৫৮৮, ১৬৪৪, আহমাদ ১০৬০৬, ১০৬২২, ১০৬৬০, মুওয়াত্তা মালিক ১৮৮০, দারেমী ১৬৪৬]"
     },
     {
         Description : "শুভ পরিণতির জন্য ধৈর্যধারণ করুন : ধৈর্যশীল ব্যক্তি সব কাজে যখন মহান রবের সিদ্ধান্তের পানে তাকিয়ে থাকেন, তখন আল্লাহ সেই ব্যক্তিকে ধৈর্যের শুভ পরিণতি দান করেন। পবিত্র কোরআনে এসেছে : ‘অতএব আপনি ধৈর্যধারণ করুন, শুভ পরিণতি তো মুত্তাকিদের জন্য নির্দিষ্ট।’ (সুরা হুদ :৪৯,)।",
         reference : "[সূরা হূদ :৪৯]"
     },
     {
Description : "আপনি তো কেবল তাই অনুসরণ করেন, যা ওহির মাধ্যমে আপনার কাছে পাঠানো হয়েছে। আর সবর করুন যতক্ষণ না আল্লাহ চূড়ান্ত ফয়সালা করেন।’ ",
reference : "[(সুরা ইউনুস : ১০৯]"
},
{
Description : "আপনি ধৈর্যধারণ করুন। আল্লাহ পুণ্যবানদের কর্মফল বিনষ্ট করেন না।",
reference : "[সুরা হুদ : ১১৫]"
},
{
Description : "আপনি (হে নবী) সবর করুন, আপনার এই সবরের তৌফিক তো আল্লাহই দিয়েছেন। তাদের জন্য দুঃখ করবেন না এবং তাদের চক্রান্তের কারণে মন ছোট করবেন না।",
reference : "[সুরা আন-নাহল : ১২৭]" 
},
{
Description : "মানবজীবন পরীক্ষাস্বরূপ। আল্লাহ রাব্বুল ইজ্জত কোরআন মাজিদে বলেন, ‘মহামহিমান্বিত তিনি সর্বময় কর্তৃত্ব যাঁর করায়ত্ত; তিনি সর্ববিষয়ে সর্বশক্তিমান। যিনি সৃষ্টি করেছেন মৃত্যু ও জীবন, তোমাদিগকে পরীক্ষা করার জন্য—কে তোমাদের মধ্যে কর্মে উত্তম? তিনি পরাক্রমশালী, ক্ষমাশীল।",
reference : "[ (সুরা-৬৭ মুলক, আয়াত: ১-২)।]"
},
{
Description : "আল্লাহ তাআলা বলেন, ‘আমি তোমাদিগকে অবশ্যই পরীক্ষা করব কিছু ভয়, ক্ষুধা এবং ধনসম্পদ, জীবন ও ফল-ফসলের ক্ষয়ক্ষতি দ্বারা। তুমি শুভ সংবাদ দাও ধৈর্যশীলগণকে—যারা তাদের ওপর বিপদ আপতিত হলে বলে, “আমরা তো আল্লাহরই এবং নিশ্চিতভাবে তাঁর দিকেই প্রত্যাবর্তনকারী”।",
reference : "[সুরা-২ বাকারা, আয়াত: ১৫৫-১৫৭]"
},
{
Description : "বিপদাপদ ও বালামসিবত থেকে পরিত্রাণের পথ সবর ও সালাত তথা নামাজ। আল্লাহ তাআলা বলেন, ‘হে মুমিনগণ! ধৈর্য ও সালাতের মাধ্যমে তোমরা সাহায্য প্রার্থনা করো, নিশ্চয়ই আল্লাহ ধৈর্যশীলদের সহিত আছেন।",
reference : "[সুরা-২ বাকারা, আয়াত: ১৫৩]"
},
{
Description : "তোমাদের কাছে যা কিছু আছে তা নিঃশেষ হয়ে যাবে। আর আল্লাহর কাছে যা আছে তা স্থায়ী। যারা সবর করে আমি তাদের উৎকৃষ্ট কাজ অনুযায়ী অবশ্যই তাদেরকে প্রতিদান দেব।",
 reference : "[সূরা নাহল (১৬) : ৯৬]"
},
{
arabic:"الصَّبْرُ ضِيَاءٌ.",
Description : "সবর ও ধৈর্য হল আলো।",
reference :"[ মুসনাদে আহমাদ, হাদীস ২২৯০২]"
},
{
arabic : "كَلَّا إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ",
Description : "কখনও নয়; নিশ্চয় আমার সাথে আমার প্রভু আছেন, তিনি আমাকে পথ দেখাবেন।",
reference : " [২৬-সূরা আশ শোয়ারা: আয়াত-৬২]"
},
{
Description : "আল্লাহ বলেন : ‘তোমরা পরস্পরে বিবাদে লিপ্ত হয়ো না। যদি তা কর তবে তোমরা কাপুরুষ হয়ে পড়বে এবং তোমাদের প্রভাব চলে যাবে। আর তোমরা ধৈর্যধারণ কর, নিশ্চয়ই আল্লাহ ধৈর্যশীলদের সাথে আছেন।",
reference : "[সুরা আনফাল : ৪৬।]"
},
{
Description : "বিপদাপদে ধৈর্যশীল হোন : লোকমান (আ.) তার পুত্রকে যে ক’টি বিষয়ে উপদেশ প্রদান করেছিলেন, তন্মধ্যে ধৈর্যধারণ করা ছিল অন্যতম একটি। পবিত্র কোরআনে সুরা লোকমান নামে পূর্ণাঙ্গ একটি সুরা অবতীর্ণ করে লোকমান হাকিমের সেই উপদেশাবলি আল্লাহ সংরক্ষিত করেছেন। এরশাদ হয়েছে : ‘হে বৎস! নামাজ কায়েম কর, সৎকাজে আদেশ দাও, মন্দকাজে নিষেধ কর এবং বিপদাপদে সবর কর। নিশ্চয়ই এটি সাহসিকতার কাজ।",
reference : "[সুরা লোকমান : ১৭ । ]"
},
{
    Description : "[সূরা আত-ত্বলাক,আয়াত ৩,মহান আল্লাহ তায়ালা বলেন,নিশ্চয় আল্লাহ তায়ালা প্রত্যেক জিনিসের জন্য একটি সময় সীমা নির্ধারণ করে দিয়েছেন। ] সুতরাং সুখের পর দুঃখ,দুঃখের পরে সুখ এটাই life circle of sunnah,ইনশাআল্লাহু তায়ালা,যে আমার রব,তিনি তার বান্দাদের সাধ্যের বাইরে কোনো বোঝা চাপিয়ে দেন না।, তিনি ভালোবাসেন তার চেয়েও বেশি,যেমন ভালোবাসে তার মা সন্তান'কে। [ফা ইন্না মা'আল 'উসরি ইউসরান, ইন্না মা'আল 'উসরি ইউসরাঅর্থ: নিশ্চয়ই কষ্টের সাথেই স্বস্তি আছে, অবশ্যই কষ্টের সাথেই স্বস্তি আছে। (সূরা ইনশিরাহ- ৯৪:৫-৬) ❤️]"
}
     ]
        
        
function getRandomQuote () {
	var randomNumber = Math.floor(Math.random() * (sabr.length));
	var randomQuote = sabr[randomNumber];
	return randomQuote;
	console.log(randomNumber);
	console.log(randomQuote);
}	

function getRandomColor () {
	var red = Math.floor(Math.random() * 256 );
	var green = Math.floor(Math.random() * 256 );
	var blue = Math.floor(Math.random() * 256 );
	 var randomColor = 'rgb(' + red + ',' + green + ',' + blue + ')';
	return randomColor;
}


function printQuote () {
		var quotes = getRandomQuote ();
				if (quotes.reference){
				    h3reference.innerHTML= `${quotes.reference}`;
				}
		if (quotes.reference == null){
				    h3reference.innerHTML= "";
				}
				
				if (quotes.Description) {
				    BanglaBornona.innerHTML=`${quotes.Description}`;
				}
				if(quotes.arabic){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML=`${quotes.arabic}`;
				}
				if(quotes.arabic == null){
   var arabicreference = document.getElementById("arabicReferenceؕ");
	arabicreference.innerHTML="";}
				refreshicon.style.backgroundColor=getRandomColor ();
}
    }
})